Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# Bookmarks_ImportErrorAt
source: (line {0}, position {1})
ar: (السطر {0}، الموضع {1})
cs: (řádek {0}, pozice {1})
de: (Zeile {0}, Position {1})
el: (γραμμή {0}, θέση {1})
es: (línea {0}, posición {1})
fa: (خط {0}، موقعیت {1})
fr: (ligne {0}, position {1})
hu: ({0}. sor, {1}. pozíció)
id: (baris {0}, posisi {1})
it: (riga {0}, posizione {1})
ja: ({0} 行目、{1} 文字目)
ko: ({0}행, {1}번째 문자)
pl: (wiersz {0}, pozycja {1})
pt: (linha {0}, posição {1})
ro: (linia {0}, poziția {1})
th: (บรรทัด {0} ตำแหน่ง {1})
tr: (satır {0}, konum {1})
uk: (рядок {0}, позиція {1})
vi: (dòng {0}, vị trí {1})
zh_hans: （第 {0} 行，第 {1} 个字符）
zh_hant: （第 {0} 行，第 {1} 個字元）

# Bookmarks_ImportErrorLine
source: (line {0})
ar: (السطر {0})
cs: (řádek {0})
de: (Zeile {0})
el: (γραμμή {0})
es: (línea {0})
fa: (خط {0})
fr: (ligne {0})
hu: ({0}. sor)
id: (baris {0})
it: (riga {0})
ja: ({0} 行目)
ko: ({0}행)
pl: (wiersz {0})
pt: (linha {0})
ro: (linia {0})
th: (บรรทัด {0})
tr: (satır {0})
uk: (рядок {0})
vi: (dòng {0})
zh_hans: （第 {0} 行）
zh_hant: （第 {0} 行）

# Bookmarks_Imported
source: Imported {0, plural, one {# bookmark} other {# bookmarks}}. Skipped {1}.
ar: {0, plural, zero {تم استيراد # إشارة مرجعية} one {تم استيراد إشارة مرجعية واحدة} two {تم استيراد إشارتين مرجعيتين} few {تم استيراد # إشارات مرجعية} many {تم استيراد # إشارة مرجعية} other {تم استيراد # إشارة مرجعية}}. تم تخطي {1}.
cs: {0, plural, one {Importována # záložka.} few {Importovány # záložky.} many {Importováno # záložky.} other {Importováno # záložek.}} Přeskočeno: {1}.
de: {0, plural, one {# Lesezeichen} other {# Lesezeichen}} importiert. {1} übersprungen.
el: {0, plural, one {Εισήχθη # σελιδοδείκτης} other {Εισήχθησαν # σελιδοδείκτες}}. Παραλείφθηκαν {1}.
es: Se {0, plural, one {importó # marcador} other {importaron # marcadores}}. Se omitieron {1}.
fa: {0, plural, one {# نشانک وارد شد} other {# نشانک وارد شد}}. {1} مورد رد شد.
fr: {0, plural, one {# signet importé} other {# signets importés}}. {1} ignorés.
hu: {0, plural, one {# könyvjelző importálva.} other {# könyvjelző importálva.}} Kihagyva: {1}.
id: {0, plural, other {# penanda}} diimpor. {1} dilewati.
it: {0, plural, one {Importato # segnalibro} other {Importati # segnalibri}}. Ignorati: {1}.
ja: {0} 件のブックマークを読み込みました。{1} 件を飛ばしました。
ko: {0, plural, other {책갈피 #개}}를 가져왔습니다. {1}개를 건너뛰었습니다.
pl: Zaimportowano {0, plural, one {# zakładkę} few {# zakładki} many {# zakładek} other {# zakładki}}. Pominięto: {1}.
pt: {0, plural, one {# marcador importado} other {# marcadores importados}}. Ignorados: {1}.
ro: {0, plural, one {S-a importat un marcaj} few {S-au importat # marcaje} other {S-au importat # de marcaje}}. Omise: {1}.
th: นำเข้า{0, plural, other {บุ๊กมาร์ก # รายการ}}แล้ว ข้าม {1} รายการ
tr: {0, plural, one {# yer işareti} other {# yer işareti}} içeri aktarıldı. {1} atlandı.
uk: {0, plural, one {Імпортовано # закладку} few {Імпортовано # закладки} many {Імпортовано # закладок} other {Імпортовано # закладки}}. Пропущено: {1}.
vi: Đã nhập {0, plural, other {# dấu trang}}. Đã bỏ qua {1}.
zh_hans: 已导入 {0, plural, other {# 个书签}}。已跳过 {1} 个。
zh_hant: 已匯入 {0, plural, other {# 個書籤}}。已略過 {1} 個。

# Bookmarks_ImportedNumbers
source: Numbers moved from existing bookmarks: {0}. Numbers removed: {1}.
ar: الأرقام المنقولة من الإشارات المرجعية الموجودة: {0}. الأرقام المزالة: {1}.
cs: Čísla přesunutá z existujících záložek: {0}. Odebraná čísla: {1}.
de: Von vorhandenen Lesezeichen übertragene Nummern: {0}. Entfernte Nummern: {1}.
el: Αριθμοί που μετακινήθηκαν από υπάρχοντες σελιδοδείκτες: {0}. Αριθμοί που καταργήθηκαν: {1}.
es: Números movidos desde marcadores existentes: {0}. Números quitados: {1}.
fa: شماره‌هایی که از نشانک‌های موجود منتقل شدند: {0}. شماره‌های حذف‌شده: {1}.
fr: Numéros déplacés depuis des signets existants : {0}. Numéros supprimés : {1}.
hu: A meglévő könyvjelzőktől átvett számok: {0}. Eltávolított számok: {1}.
id: Nomor yang dipindahkan dari penanda yang ada: {0}. Nomor yang dihapus: {1}.
it: Numeri spostati dai segnalibri esistenti: {0}. Numeri rimossi: {1}.
ja: 既存のブックマークから移した番号: {0}。外した番号: {1} 件。
ko: 기존 책갈피에서 옮긴 번호: {0}. 제거한 번호: {1}.
pl: Numery przeniesione z istniejących zakładek: {0}. Usunięte numery: {1}.
pt: Números movidos de marcadores existentes: {0}. Números removidos: {1}.
ro: Numere mutate de la marcajele existente: {0}. Numere eliminate: {1}.
th: หมายเลขที่ย้ายจากบุ๊กมาร์กที่มีอยู่: {0} หมายเลขที่นำออก: {1}
tr: Mevcut yer işaretlerinden taşınan numaralar: {0}. Kaldırılan numaralar: {1}.
uk: Номери, перенесені з наявних закладок: {0}. Видалені номери: {1}.
vi: Số được chuyển từ dấu trang hiện có: {0}. Số bị gỡ bỏ: {1}.
zh_hans: 从现有书签移来的编号：{0}。已删除的编号：{1}。
zh_hant: 從現有書籤移來的編號：{0}。已移除的編號：{1}。

# Bookmarks_SelectionGroup
source: Selections {0}
ar: التحديدات {0}
cs: Výběry {0}
de: Auswahlen {0}
el: Επιλογές {0}
es: Selecciones {0}
fa: انتخاب‌ها {0}
fr: Sélections {0}
hu: {0} kijelölés
id: Pilihan {0}
it: Selezioni {0}
ja: 選択範囲 {0}
ko: 선택 영역 {0}
pl: Zaznaczenia {0}
pt: Seleções {0}
ro: Selecții {0}
th: ส่วนที่เลือก {0}
tr: Seçimler {0}
uk: Виділення {0}
vi: Vùng chọn {0}
zh_hans: 选定内容 {0}
zh_hant: 選取範圍 {0}

# Bookmarks_SelectionName
source: Selection {0}
ar: التحديد {0}
cs: Výběr {0}
de: Auswahl {0}
el: Επιλογή {0}
es: Selección {0}
fa: انتخاب {0}
fr: Sélection {0}
hu: {0}. kijelölés
id: Pilihan {0}
it: Selezione {0}
ja: 選択 {0}
ko: 선택 {0}
pl: Zaznaczenie {0}
pt: Seleção {0}
ro: Selecția {0}
th: ส่วนที่เลือก {0}
tr: Seçim {0}
uk: Виділення {0}
vi: Vùng chọn {0}
zh_hans: 选定内容 {0}
zh_hant: 選取 {0}

# Bookmarks_SelectionLimit
source: Only the first {0} ranges were selected.
ar: تم تحديد أول {0} نطاق فقط.
cs: Bylo vybráno jen prvních {0} rozsahů.
de: Nur die ersten {0} Bereiche wurden ausgewählt.
el: Επιλέχθηκαν μόνο οι πρώτες {0} περιοχές.
es: Solo se seleccionaron los primeros {0} rangos.
fa: فقط {0} محدودهٔ نخست انتخاب شد.
fr: Seules les {0} premières plages ont été sélectionnées.
hu: Csak az első {0} tartomány lett kijelölve.
id: Hanya {0} rentang pertama yang dipilih.
it: Sono stati selezionati solo i primi {0} intervalli.
ja: 先頭の {0} 範囲だけを選択しました。
ko: 처음 {0}개 범위만 선택했습니다.
pl: Zaznaczono tylko początkowe zakresy (liczba: {0}).
pt: Somente os primeiros {0} intervalos foram selecionados.
ro: Au fost selectate doar primele {0} intervale.
th: เลือกเฉพาะ {0} ช่วงแรกเท่านั้น
tr: Yalnızca ilk {0} aralık seçildi.
uk: Виділено лише перші {0} діапазонів.
vi: Chỉ {0} phạm vi đầu tiên được chọn.
zh_hans: 仅选择了前 {0} 个范围。
zh_hant: 只選取了前 {0} 個範圍。

# Coloring_PanelName
source: Coloring rules
ar: قواعد التلوين
cs: Pravidla obarvení
de: Farbregeln
el: Κανόνες χρωματισμού
es: Reglas de coloreado
fa: قواعد رنگ‌آمیزی
fr: Règles de coloration
hu: Színezési szabályok
id: Aturan pewarnaan
it: Regole di colorazione
ja: 色付けルール
ko: 색 지정 규칙
pl: Reguły kolorowania
pt: Regras de coloração
ro: Reguli de colorare
th: กฎการระบายสี
tr: Renklendirme kuralları
uk: Правила розфарбовування
vi: Quy tắc tô màu
zh_hans: 着色规则
zh_hant: 著色規則

# Coloring_ScopeDocument.Content
source: This document
ar: هذا المستند
cs: Tento dokument
de: Dieses Dokument
el: Αυτό το έγγραφο
es: Este documento
fa: این سند
fr: Ce document
hu: Ez a dokumentum
id: Dokumen ini
it: Questo documento
ja: このドキュメント
ko: 이 문서
pl: Ten dokument
pt: Este documento
ro: Acest document
th: เอกสารนี้
tr: Bu belge
uk: Цей документ
vi: Tài liệu này
zh_hans: 此文档
zh_hant: 此文件

# Coloring_ScopeGlobal.Content
source: All documents
ar: كل المستندات
cs: Všechny dokumenty
de: Alle Dokumente
el: Όλα τα έγγραφα
es: Todos los documentos
fa: همهٔ سندها
fr: Tous les documents
hu: Minden dokumentum
id: Semua dokumen
it: Tutti i documenti
ja: 全体
ko: 모든 문서
pl: Wszystkie dokumenty
pt: Todos os documentos
ro: Toate documentele
th: เอกสารทั้งหมด
tr: Tüm belgeler
uk: Усі документи
vi: Tất cả tài liệu
zh_hans: 所有文档
zh_hant: 所有文件

# Coloring_AddName
source: Add rule
ar: إضافة قاعدة
cs: Přidat pravidlo
de: Regel hinzufügen
el: Προσθήκη κανόνα
es: Agregar regla
fa: افزودن قاعده
fr: Ajouter une règle
hu: Szabály hozzáadása
id: Tambah aturan
it: Aggiungi regola
ja: ルールを追加
ko: 규칙 추가
pl: Dodaj regułę
pt: Adicionar regra
ro: Adăugare regulă
th: เพิ่มกฎ
tr: Kural ekle
uk: Додати правило
vi: Thêm quy tắc
zh_hans: 添加规则
zh_hant: 新增規則

# Coloring_DeleteName
source: Delete rule
ar: حذف القاعدة
cs: Odstranit pravidlo
de: Regel löschen
el: Διαγραφή κανόνα
es: Eliminar regla
fa: حذف قاعده
fr: Supprimer la règle
hu: Szabály törlése
id: Hapus aturan
it: Elimina regola
ja: ルールを削除
ko: 규칙 삭제
pl: Usuń regułę
pt: Excluir regra
ro: Ștergere regulă
th: ลบกฎ
tr: Kuralı sil
uk: Видалити правило
vi: Xóa quy tắc
zh_hans: 删除规则
zh_hant: 刪除規則

# Coloring_MoveUpName
source: Move up (higher priority)
ar: نقل لأعلى (أولوية أعلى)
cs: Posunout nahoru (vyšší priorita)
de: Nach oben (höhere Priorität)
el: Μετακίνηση επάνω (υψηλότερη προτεραιότητα)
es: Subir (mayor prioridad)
fa: انتقال به بالا (اولویت بالاتر)
fr: Monter (priorité plus élevée)
hu: Feljebb (magasabb prioritás)
id: Pindahkan ke atas (prioritas lebih tinggi)
it: Sposta su (priorità maggiore)
ja: 上へ (優先する)
ko: 위로 이동(우선순위 높임)
pl: Przenieś w górę (wyższy priorytet)
pt: Mover para cima (prioridade maior)
ro: Mutare în sus (prioritate mai mare)
th: ย้ายขึ้น (ลำดับความสำคัญสูงขึ้น)
tr: Yukarı taşı (daha yüksek öncelik)
uk: Перемістити вгору (вищий пріоритет)
vi: Chuyển lên (ưu tiên cao hơn)
zh_hans: 上移（提高优先级）
zh_hant: 上移（較高優先順序）

# Coloring_MoveDownName
source: Move down
ar: نقل لأسفل
cs: Posunout dolů
de: Nach unten
el: Μετακίνηση κάτω
es: Bajar
fa: انتقال به پایین
fr: Descendre
hu: Lejjebb
id: Pindahkan ke bawah
it: Sposta giù
ja: 下へ
ko: 아래로 이동
pl: Przenieś w dół
pt: Mover para baixo
ro: Mutare în jos
th: ย้ายลง
tr: Aşağı taşı
uk: Перемістити вниз
vi: Chuyển xuống
zh_hans: 下移
zh_hant: 下移

# Coloring_Name.Header
source: Name
ar: الاسم
cs: Název
el: Όνομα
es: Nombre
fa: نام
fr: Nom
hu: Név
id: Nama
it: Nome
ja: 名前
ko: 이름
pl: Nazwa
pt: Nome
ro: Nume
th: ชื่อ
tr: Ad
uk: Ім’я
vi: Tên
zh_hans: 名称
zh_hant: 名稱

# Coloring_Kind.Header
source: Condition
ar: الشرط
cs: Podmínka
de: Bedingung
el: Συνθήκη
es: Condición
fa: شرط
hu: Feltétel
id: Kondisi
it: Condizione
ja: 条件
ko: 조건
pl: Warunek
pt: Condição
ro: Condiție
th: เงื่อนไข
tr: Koşul
uk: Умова
vi: Điều kiện
zh_hans: 条件
zh_hant: 條件

# Coloring_Kind_ByteValues
source: Byte values
ar: قيم البايتات
cs: Hodnoty bajtů
de: Bytewerte
el: Τιμές byte
es: Valores de byte
fa: مقادیر بایت
fr: Valeurs d'octets
hu: Bájtértékek
id: Nilai byte
it: Valori dei byte
ja: バイト値
ko: 바이트 값
pl: Wartości bajtów
pt: Valores de byte
ro: Valori de octeți
th: ค่าไบต์
tr: Bayt değerleri
uk: Значення байтів
vi: Giá trị byte
zh_hans: 字节值
zh_hant: 位元組值

# Coloring_Kind_OffsetRange
source: Offset range
ar: نطاق الإزاحات
cs: Rozsah posunů
de: Offset-Bereich
el: Εύρος μετατοπίσεων
es: Rango de desplazamientos
fa: محدودهٔ آفست
fr: Plage de décalages
hu: Eltolástartomány
id: Rentang offset
it: Intervallo di offset
ja: オフセット範囲
ko: 오프셋 범위
pl: Zakres przesunięć
pt: Intervalo de deslocamentos
ro: Interval de deplasamente
th: ช่วงออฟเซ็ต
tr: Ofset aralığı
uk: Діапазон зміщень
vi: Phạm vi độ lệch
zh_hans: 偏移量范围
zh_hant: 位移範圍

# Coloring_Kind_Period
source: Period
ar: الدورة
cs: Perioda
de: Periode
el: Περίοδος
es: Período
fa: دوره
fr: Période
hu: Periódus
id: Periode
it: Periodo
ja: 周期
ko: 주기
pl: Okres
pt: Período
ro: Perioadă
th: รอบ
tr: Periyot
uk: Період
vi: Chu kỳ
zh_hans: 周期
zh_hant: 週期

# Coloring_Kind_HexPattern
source: Hex pattern
ar: نمط Hex
cs: Vzor Hex
de: Hex-Muster
el: Μοτίβο Hex
es: Patrón Hex
fa: الگوی Hex
fr: Motif Hex
hu: Hex minta
id: Pola Hex
it: Modello Hex
ja: Hex パターン
ko: Hex 패턴
pl: Wzorzec Hex
pt: Padrão Hex
ro: Model Hex
th: รูปแบบ Hex
tr: Hex deseni
uk: Шаблон Hex
vi: Mẫu Hex
zh_hans: Hex 模式
zh_hant: Hex 模式

# Coloring_Kind_Text
source: Text
ar: نص
el: Κείμενο
es: Texto
fa: متن
fr: Texte
hu: Szöveg
id: Teks
it: Testo
ja: テキスト
ko: 텍스트
pl: Tekst
pt: Texto
th: ข้อความ
tr: Metin
uk: Текст
vi: Văn bản
zh_hans: 文本
zh_hant: 文字

# Coloring_Kind_Regex
source: Regular expression
ar: تعبير عادي
cs: Regulární výraz
de: Regulärer Ausdruck
el: Κανονική έκφραση
es: Expresión regular
fa: عبارت باقاعده
fr: Expression régulière
hu: Reguláris kifejezés
id: Ekspresi reguler
it: Espressione regolare
ja: 正規表現
ko: 정규식
pl: Wyrażenie regularne
pt: Expressão regular
ro: Expresie regulată
th: นิพจน์ทั่วไป
tr: Normal ifade
uk: Регулярний вираз
vi: Biểu thức chính quy
zh_hans: 正则表达式
zh_hant: 規則運算式

# Coloring_Kind_Number
source: Number
ar: رقم
cs: Číslo
de: Zahl
el: Αριθμός
es: Número
fa: عدد
fr: Nombre
hu: Szám
id: Angka
it: Numero
ja: 数値
ko: 숫자
pl: Liczba
pt: Número
ro: Număr
th: ตัวเลข
tr: Sayı
uk: Число
vi: Số
zh_hans: 数值
zh_hant: 數值

# Coloring_PatternName
source: Condition value
ar: قيمة الشرط
cs: Hodnota podmínky
de: Bedingungswert
el: Τιμή συνθήκης
es: Valor de la condición
fa: مقدار شرط
fr: Valeur de la condition
hu: Feltétel értéke
id: Nilai kondisi
it: Valore della condizione
ja: 条件の値
ko: 조건 값
pl: Wartość warunku
pt: Valor da condição
ro: Valoarea condiției
th: ค่าเงื่อนไข
tr: Koşul değeri
uk: Значення умови
vi: Giá trị điều kiện
zh_hans: 条件值
zh_hant: 條件值

# Coloring_PatternHeader_ByteValues
source: Values and ranges (00, 20-7E, 7F, 80-FF)
ar: القيم والنطاقات (00، 20-7E، 7F، 80-FF)
cs: Hodnoty a rozsahy (00, 20-7E, 7F, 80-FF)
de: Werte und Bereiche (00, 20-7E, 7F, 80-FF)
el: Τιμές και εύρη (00, 20-7E, 7F, 80-FF)
es: Valores y rangos (00, 20-7E, 7F, 80-FF)
fa: مقادیر و محدوده‌ها (00، 20-7E، 7F، 80-FF)
fr: Valeurs et plages (00, 20-7E, 7F, 80-FF)
hu: Értékek és tartományok (00, 20-7E, 7F, 80-FF)
id: Nilai dan rentang (00, 20-7E, 7F, 80-FF)
it: Valori e intervalli (00, 20-7E, 7F, 80-FF)
ja: 値と範囲の並び (00、20-7E、7F, 80-FF)
ko: 값 및 범위(00, 20-7E, 7F, 80-FF)
pl: Wartości i zakresy (00, 20-7E, 7F, 80-FF)
pt: Valores e intervalos (00, 20-7E, 7F, 80-FF)
ro: Valori și intervale (00, 20-7E, 7F, 80-FF)
th: ค่าและช่วง (00, 20-7E, 7F, 80-FF)
tr: Değerler ve aralıklar (00, 20-7E, 7F, 80-FF)
uk: Значення й діапазони (00, 20-7E, 7F, 80-FF)
vi: Giá trị và phạm vi (00, 20-7E, 7F, 80-FF)
zh_hans: 值和范围（00、20-7E、7F、80-FF）
zh_hant: 值和範圍（00、20-7E、7F、80-FF）

# Coloring_PatternHeader_OffsetRange
source: Start (expression)
ar: البداية (تعبير)
cs: Začátek (výraz)
de: Anfang (Ausdruck)
el: Αρχή (παράσταση)
es: Inicio (expresión)
fa: آغاز (عبارت)
fr: Début (expression)
hu: Kezdet (kifejezés)
id: Awal (ekspresi)
it: Inizio (espressione)
ja: 開始 (入力式)
ko: 시작(식)
pl: Początek (wyrażenie)
pt: Início (expressão)
ro: Început (expresie)
th: เริ่มต้น (นิพจน์)
tr: Başlangıç (ifade)
uk: Початок (вираз)
vi: Bắt đầu (biểu thức)
zh_hans: 开始（表达式）
zh_hant: 開頭（運算式）

# Coloring_PatternHeader_Period
source: Period
ar: الدورة
cs: Perioda
de: Periode
el: Περίοδος
es: Período
fa: دوره
fr: Période
hu: Periódus
id: Periode
it: Periodo
ja: 周期
ko: 주기
pl: Okres
pt: Período
ro: Perioadă
th: รอบ
tr: Periyot
uk: Період
vi: Chu kỳ
zh_hans: 周期
zh_hant: 週期

# Coloring_PatternHeader_HexPattern
source: Hex pattern (?? matches any byte)
ar: نمط Hex (?? يطابق أي بايت)
cs: Vzor Hex (?? odpovídá libovolnému bajtu)
de: Hex-Muster (?? passt auf jedes Byte)
el: Μοτίβο Hex (το ?? αντιστοιχεί σε οποιοδήποτε byte)
es: Patrón Hex (?? coincide con cualquier byte)
fa: الگوی Hex (?? با هر بایتی مطابقت دارد)
fr: Motif Hex (?? correspond à n'importe quel octet)
hu: Hex minta (a ?? bármely bájtra illeszkedik)
id: Pola Hex (?? cocok dengan byte apa pun)
it: Modello Hex (?? corrisponde a qualsiasi byte)
ja: Hex パターン (?? は任意の 1 バイト)
ko: Hex 패턴(??는 임의의 바이트와 일치)
pl: Wzorzec Hex (?? pasuje do dowolnego bajtu)
pt: Padrão Hex (?? corresponde a qualquer byte)
ro: Model Hex (?? corespunde oricărui octet)
th: รูปแบบ Hex (?? ตรงกับไบต์ใดก็ได้)
tr: Hex deseni (?? herhangi bir baytla eşleşir)
uk: Шаблон Hex (?? відповідає будь-якому байту)
vi: Mẫu Hex (?? khớp mọi byte)
zh_hans: Hex 模式（?? 匹配任意字节）
zh_hant: Hex 模式（?? 符合任何位元組）

# Coloring_PatternHeader_Text
source: Text
ar: النص
el: Κείμενο
es: Texto
fa: متن
fr: Texte
hu: Szöveg
id: Teks
it: Testo
ja: 文字列
ko: 텍스트
pl: Tekst
pt: Texto
th: ข้อความ
tr: Metin
uk: Текст
vi: Văn bản
zh_hans: 文本
zh_hant: 文字

# Coloring_PatternHeader_Regex
source: Regular expression (matches up to 256 bytes)
ar: تعبير عادي (يطابق حتى 256 بايت)
cs: Regulární výraz (shoda nejvýše 256 bajtů)
de: Regulärer Ausdruck (Treffer bis 256 Bytes)
el: Κανονική έκφραση (αντιστοιχίζει έως 256 byte)
es: Expresión regular (coincidencias de hasta 256 bytes)
fa: عبارت باقاعده (تا 256 بایت مطابقت می‌دهد)
fr: Expression régulière (correspondances jusqu'à 256 octets)
hu: Reguláris kifejezés (legfeljebb 256 bájtra illeszkedik)
id: Ekspresi reguler (cocok hingga 256 byte)
it: Espressione regolare (corrispondenze fino a 256 byte)
ja: 正規表現 (一致の最大長は 256 バイト)
ko: 정규식(최대 256바이트까지 일치)
pl: Wyrażenie regularne (dopasowania do 256 bajtów)
pt: Expressão regular (correspondências de até 256 bytes)
ro: Expresie regulată (corespunde cu cel mult 256 de octeți)
th: นิพจน์ทั่วไป (ตรงกันได้สูงสุด 256 ไบต์)
tr: Normal ifade (en fazla 256 baytla eşleşir)
uk: Регулярний вираз (до 256 байтів)
vi: Biểu thức chính quy (khớp tối đa 256 byte)
zh_hans: 正则表达式（最多匹配 256 字节）
zh_hant: 規則運算式（最多符合 256 個位元組）

# Coloring_PatternHeader_Number
source: Value or range (0..0xFF)
ar: قيمة أو نطاق (0..0xFF)
cs: Hodnota nebo rozsah (0..0xFF)
de: Wert oder Bereich (0..0xFF)
el: Τιμή ή εύρος (0..0xFF)
es: Valor o rango (0..0xFF)
fa: مقدار یا محدوده (0..0xFF)
fr: Valeur ou plage (0..0xFF)
hu: Érték vagy tartomány (0..0xFF)
id: Nilai atau rentang (0..0xFF)
it: Valore o intervallo (0..0xFF)
ja: 値または範囲 (0..0xFF)
ko: 값 또는 범위(0..0xFF)
pl: Wartość lub zakres (0..0xFF)
pt: Valor ou intervalo (0..0xFF)
ro: Valoare sau interval (0..0xFF)
th: ค่าหรือช่วง (0..0xFF)
tr: Değer veya aralık (0..0xFF)
uk: Значення або діапазон (0..0xFF)
vi: Giá trị hoặc phạm vi (0..0xFF)
zh_hans: 值或范围（0..0xFF）
zh_hant: 值或範圍（0..0xFF）

# Coloring_End.Header
source: End (this byte included)
ar: النهاية (يشمل هذا البايت)
cs: Konec (včetně tohoto bajtu)
de: Ende (dieses Byte eingeschlossen)
el: Τέλος (συμπεριλαμβάνεται αυτό το byte)
es: Final (incluido este byte)
fa: پایان (شامل این بایت)
fr: Fin (cet octet inclus)
hu: Vég (ezzel a bájttal együtt)
id: Akhir (termasuk byte ini)
it: Fine (byte incluso)
ja: 終了 (このバイトを含む)
ko: 끝(이 바이트 포함)
pl: Koniec (łącznie z tym bajtem)
pt: Fim (este byte incluído)
ro: Sfârșit (inclusiv acest octet)
th: สิ้นสุด (รวมไบต์นี้)
tr: Son (bu bayt dahil)
uk: Кінець (включно з цим байтом)
vi: Kết thúc (bao gồm byte này)
zh_hans: 结束（含此字节）
zh_hant: 結束（含此位元組）

# Coloring_Modulus.Header
source: Every (bytes)
ar: كل (بايت)
cs: Každých (bajtů)
de: Alle (Bytes)
el: Κάθε (byte)
es: Cada (bytes)
fa: هر (بایت)
fr: Tous les (octets)
hu: Ismétlődés (bájt)
id: Setiap (byte)
it: Ogni (byte)
ja: 間隔 (バイト)
ko: 간격(바이트)
pl: Co (bajtów)
pt: A cada (bytes)
ro: La fiecare (octeți)
th: ทุกๆ (ไบต์)
tr: Her (bayt)
uk: Кожні (байтів)
vi: Mỗi (byte)
zh_hans: 间隔（字节）
zh_hant: 間隔（位元組）

# Coloring_Remainder.Header
source: At position
ar: عند الموضع
cs: Na pozici
de: An Position
el: Στη θέση
es: En la posición
fa: در موقعیت
fr: À la position
hu: Pozíció
id: Di posisi
it: Alla posizione
ja: 位置
ko: 위치
pl: Na pozycji
pt: Na posição
ro: La poziția
th: ที่ตำแหน่ง
tr: Konumda
uk: У позиції
vi: Tại vị trí
zh_hans: 位置
zh_hant: 位置

# Coloring_PeriodLength.Header
source: Length
ar: الطول
cs: Délka
de: Länge
el: Μήκος
es: Longitud
fa: طول
fr: Longueur
hu: Hossz
id: Panjang
it: Lunghezza
ja: 長さ
ko: 길이
pl: Długość
pt: Comprimento
ro: Lungime
th: ความยาว
tr: Uzunluk
uk: Довжина
vi: Độ dài
zh_hans: 长度
zh_hant: 長度

# Coloring_CodePage.Header
source: Encoding
ar: الترميز
cs: Kódování
de: Codierung
el: Κωδικοποίηση
es: Codificación
fa: رمزگذاری
fr: Encodage
hu: Kódolás
id: Pengodean
it: Codifica
ja: 文字コード
ko: 인코딩
pl: Kodowanie
pt: Codificação
ro: Codificare
th: การเข้ารหัส
tr: Kodlama
uk: Кодування
vi: Bảng mã
zh_hans: 编码
zh_hant: 編碼

# Coloring_CaseSensitive.Content
source: Match case
ar: مطابقة حالة الأحرف
cs: Rozlišovat velká a malá písmena
de: Groß-/Kleinschreibung beachten
el: Διάκριση πεζών-κεφαλαίων
es: Coincidir mayúsculas y minúsculas
fa: تطبیق بزرگی و کوچکی حروف
fr: Respecter la casse
hu: Kis- és nagybetűk megkülönböztetése
id: Cocokkan huruf besar/kecil
it: Maiuscole/minuscole
ja: 大文字・小文字を区別する
ko: 대/소문자 구분
pl: Uwzględniaj wielkość liter
pt: Diferenciar maiúsculas e minúsculas
ro: Potrivire litere mari și mici
th: ตรงตามตัวพิมพ์ใหญ่-เล็ก
tr: Büyük/küçük harf eşleştir
uk: Враховувати регістр
vi: Khớp chữ hoa/thường
zh_hans: 区分大小写
zh_hant: 大小寫須相符

# Coloring_RegexOnText.Content
source: Match decoded text
ar: مطابقة النص المفكوك ترميزه
cs: Porovnávat dekódovaný text
de: Decodierten Text vergleichen
el: Αντιστοίχιση αποκωδικοποιημένου κειμένου
es: Comparar con el texto decodificado
fa: تطبیق متن رمزگشایی‌شده
fr: Comparer le texte décodé
hu: Illesztés a dekódolt szövegre
id: Cocokkan teks yang didekode
it: Applica al testo decodificato
ja: 解読した文字列に使う
ko: 디코딩된 텍스트와 일치
pl: Dopasuj zdekodowany tekst
pt: Aplicar ao texto decodificado
ro: Potrivire pe textul decodificat
th: จับคู่กับข้อความที่ถอดรหัสแล้ว
tr: Çözülmüş metinle eşleştir
uk: Зіставляти з декодованим текстом
vi: Khớp văn bản đã giải mã
zh_hans: 匹配解码后的文本
zh_hant: 比對解碼後的文字

# Coloring_NumberType.Header
source: Type
ar: النوع
cs: Typ
de: Typ
el: Τύπος
es: Tipo
fa: نوع
hu: Típus
id: Tipe
it: Tipo
ja: 型
ko: 형식
pl: Typ
pt: Tipo
ro: Tip
th: ชนิด
tr: Tür
uk: Тип
vi: Kiểu
zh_hans: 类型
zh_hant: 類型

# Coloring_UseForeground.Content
source: Text color
ar: لون النص
cs: Barva textu
de: Textfarbe
el: Χρώμα κειμένου
es: Color del texto
fa: رنگ متن
fr: Couleur du texte
hu: Szövegszín
id: Warna teks
it: Colore del testo
ja: 文字色
ko: 텍스트 색
pl: Kolor tekstu
pt: Cor do texto
ro: Culoare text
th: สีข้อความ
tr: Metin rengi
uk: Колір тексту
vi: Màu chữ
zh_hans: 文本颜色
zh_hant: 文字色彩

# Coloring_UseBackground.Content
source: Background
ar: الخلفية
cs: Pozadí
de: Hintergrund
el: Φόντο
es: Fondo
fa: پس‌زمینه
fr: Arrière-plan
hu: Háttér
id: Latar
it: Sfondo
ja: 背景色
ko: 배경
pl: Tło
pt: Plano de fundo
ro: Fundal
th: พื้นหลัง
tr: Arka plan
uk: Фон
vi: Nền
zh_hans: 背景
zh_hant: 背景

# Coloring_BorderChoice.Header
source: Border
ar: الإطار
cs: Ohraničení
de: Rahmen
el: Περίγραμμα
es: Borde
fa: حاشیه
fr: Bordure
hu: Szegély
id: Bingkai
it: Bordo
ja: 枠線
ko: 테두리
pl: Obramowanie
pt: Borda
ro: Bordură
th: เส้นขอบ
tr: Kenarlık
uk: Рамка
vi: Viền
zh_hans: 边框
zh_hant: 框線

# Coloring_Border_None
source: No border
ar: بلا إطار
cs: Bez ohraničení
de: Kein Rahmen
el: Χωρίς περίγραμμα
es: Sin borde
fa: بدون حاشیه
fr: Aucune bordure
hu: Nincs szegély
id: Tanpa bingkai
it: Nessun bordo
ja: 枠線なし
ko: 테두리 없음
pl: Bez obramowania
pt: Sem borda
ro: Fără bordură
th: ไม่มีเส้นขอบ
tr: Kenarlık yok
uk: Без рамки
vi: Không viền
zh_hans: 无边框
zh_hant: 無框線

# Coloring_Border_Solid
source: Solid border
ar: إطار متصل
cs: Plné ohraničení
de: Durchgezogener Rahmen
el: Συνεχές περίγραμμα
es: Borde continuo
fa: حاشیهٔ پیوسته
fr: Bordure pleine
hu: Folytonos szegély
id: Bingkai solid
it: Bordo continuo
ja: 実線
ko: 실선 테두리
pl: Obramowanie ciągłe
pt: Borda sólida
ro: Bordură continuă
th: เส้นขอบทึบ
tr: Düz kenarlık
uk: Суцільна рамка
vi: Viền liền
zh_hans: 实线边框
zh_hant: 實線框線

# Coloring_Border_Dashed
source: Dashed border
ar: إطار متقطع
cs: Čárkované ohraničení
de: Gestrichelter Rahmen
el: Διακεκομμένο περίγραμμα
es: Borde discontinuo
fa: حاشیهٔ خط‌چین
fr: Bordure tiretée
hu: Szaggatott szegély
id: Bingkai putus-putus
it: Bordo tratteggiato
ja: 破線
ko: 파선 테두리
pl: Obramowanie kreskowane
pt: Borda tracejada
ro: Bordură întreruptă
th: เส้นขอบประ
tr: Kesik çizgili kenarlık
uk: Штрихова рамка
vi: Viền gạch
zh_hans: 虚线边框
zh_hant: 虛線框線
